In [1]:
import pandas as pd

# PANDA DATA

### Create Data

In [2]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### shape

In [132]:
df.shape

(6, 4)

### info

In [133]:
df.info

<bound method DataFrame.info of     Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica
d  Mandy    5            25  Greenland
e  Candy    4            30    Siberia
f  Landy    2            35  Antartica>

### Head (first five rows)

In [5]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [6]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [7]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [8]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [9]:
df[df['Age']<5]

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### Multiple filtering

In [32]:
df[['Bamboo Stick','Age']]

   Bamboo Stick  Age
0            10    6
1            15    7
2            20    4
3            25    5
4            30    4
5            35    2

In [34]:
df[ (df['Age']>4) & (df['Bamboo Stick']>10) ]

    Name  Age  Bamboo Stick
1  Sandy    7            15
3  Mandy    5            25

### Add Column

In [61]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [62]:
df

    Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica
d  Mandy    5            25  Greenland
e  Candy    4            30    Siberia
f  Landy    2            35  Antartica

### Drop Duplicate

In [128]:
df.drop_duplicates(subset=['Place'])

    Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica

In [129]:
df.drop_duplicates(subset=['Place'],keep='first' )

    Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica

In [130]:
df.drop_duplicates(subset=['Place'],keep='last' )

    Name  Age  Bamboo Stick      Place
d  Mandy    5            25  Greenland
e  Candy    4            30    Siberia
f  Landy    2            35  Antartica

### Vlaue Counts

In [136]:
df['Place'].value_counts()

Place
Greenland    2
Siberia      2
Antartica    2
Name: count, dtype: int64

In [137]:
df['Age'].value_counts()

Age
4    2
6    1
7    1
5    1
2    1
Name: count, dtype: int64

### Transpose

In [63]:
df.T

                      a        b          c          d        e          f
Name              Pandy    Sandy      Randy      Mandy    Candy      Landy
Age                   6        7          4          5        4          2
Bamboo Stick         10       15         20         25       30         35
Place         Greenland  Siberia  Antartica  Greenland  Siberia  Antartica

### Update (loc)

In [101]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [102]:
df

    Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica
d  Mandy    5            25  Greenland
e  Candy    4            30    Siberia
f  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

#### Delete one Column

In [ ]:
df.drop('Place',axis=1)

In [ ]:
#### Delete multiple Column

In [ ]:
#df.drop(['Place','Bamboo Stick'],axis=1)

#### Delete Row

In [ ]:
df

In [ ]:
 df.drop(df[df['Name'] == 'Candy'].index)

✅ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
🔍 .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [ ]:
df

### iloc

### show row data

In [103]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: c, dtype: object

In [104]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
a  Pandy    6            10  Greenland
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica

In [105]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
b  Sandy    7            15    Siberia
c  Randy    4            20  Antartica

### show coulmn data

In [ ]:
df ['Place']

#### row and column

In [ ]:
df.iloc [0:2,1:3]

###  New index

In [53]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [54]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### loc

#### column

In [55]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [56]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [ ]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [ ]:
df.to_csv('noIndex_panda.csv', index=False)

In [ ]:
df

### Statistical Analysis

In [ ]:
df.describe()

# EXERCISE SESSION

### Json

In [113]:
df_json=pd.read_json('test.json')

In [114]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [ ]:
df_json.head()

### shape

In [ ]:
df_json.shape

### Read CSV

In [ ]:
df_json.to_csv("test_excel.csv",index=False)

In [ ]:
df_csv=pd.read_csv("test_excel.csv")

In [ ]:
df_csv

### excel convert

In [ ]:
df_excel=df_csv.drop('Calories',axis=1)

In [ ]:
df_excel

pip install openpyxl

In [ ]:
df_excel.to_excel("output.xlsx",index=False)

In [ ]:
df_excel

###  Data Merge

In [ ]:
left= pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Pandy', 'Mandy',' Sandy']
})
right= pd.DataFrame({
    'ID': [1,2,4],
    'Hobby': ['Eating', 'Dancing',' Sleeping']
})

In [ ]:
merged_df=pd.merge(left,right, on='ID', how='inner')

In [ ]:
merged_df

### concat

### row

In [ ]:
concat_df=pd.concat([left,right],ignore_index=True) #ignore index helps to prevent overflow of index

In [ ]:
concat_df

### coulmn

In [ ]:
concat_df=pd.concat([left,right],axis=1)

In [ ]:
concat_df

#  NUMERICAL RANDOM DATA

### Series

In [15]:
import numpy as np

In [16]:
ser = pd.Series(np.random.rand(34))

In [17]:
ser

0     0.437257
1     0.672167
2     0.643318
3     0.126129
4     0.476269
5     0.488270
6     0.200462
7     0.789680
8     0.721839
9     0.865649
10    0.967068
11    0.268808
12    0.865886
13    0.415624
14    0.440656
15    0.318285
16    0.895138
17    0.239229
18    0.397665
19    0.135752
20    0.940840
21    0.581217
22    0.538594
23    0.779565
24    0.841457
25    0.277844
26    0.770780
27    0.872953
28    0.581109
29    0.322640
30    0.398181
31    0.597990
32    0.521998
33    0.806736
dtype: float64

In [18]:
type(ser)

pandas.core.series.Series

### Data Frame

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [20]:
newdf

            0         1         2         3         4
0    0.261221  0.173479  0.293431  0.210040  0.470557
1    0.932840  0.818319  0.479297  0.760338  0.721950
2    0.486321  0.481523  0.735185  0.128476  0.924048
3    0.302316  0.062426  0.980375  0.562350  0.656357
4    0.195441  0.491135  0.394913  0.429096  0.338784
..        ...       ...       ...       ...       ...
329  0.948860  0.357541  0.070486  0.411866  0.090378
330  0.123490  0.310212  0.020913  0.838736  0.445750
331  0.555272  0.514109  0.716483  0.712038  0.408906
332  0.014566  0.643004  0.506736  0.779470  0.421636
333  0.676938  0.125761  0.760196  0.340717  0.594747

[334 rows x 5 columns]

In [21]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [24]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

### Convert to Numpy

In [28]:
newdf.to_numpy()

array([[0.26122059, 0.17347933, 0.29343143, 0.21003997, 0.47055689],
       [0.93283979, 0.81831893, 0.47929661, 0.76033833, 0.72195037],
       [0.48632113, 0.48152292, 0.73518498, 0.12847553, 0.9240483 ],
       ...,
       [0.55527223, 0.51410924, 0.71648271, 0.71203788, 0.40890648],
       [0.01456566, 0.64300408, 0.50673608, 0.77946969, 0.421636  ],
       [0.6769379 , 0.12576108, 0.76019607, 0.34071723, 0.59474727]],
      shape=(334, 5))

In [29]:
newdf.head()

          0         1         2         3         4
0  0.261221  0.173479  0.293431  0.210040  0.470557
1  0.932840  0.818319  0.479297  0.760338  0.721950
2  0.486321  0.481523  0.735185  0.128476  0.924048
3  0.302316  0.062426  0.980375  0.562350  0.656357
4  0.195441  0.491135  0.394913  0.429096  0.338784

### Sort

In [42]:
sortdf = pd.DataFrame(np.random.randint(0,50,size=(334,5)))

In [43]:
sortdf

      0   1   2   3   4
0    26   8  46   7  42
1    23  25  12  32  16
2    19   7   2  21  40
3    46  35  31  19  18
4    39  42  29  34  49
..   ..  ..  ..  ..  ..
329   3  48  19  45   1
330  24  10  19   1   3
331   8  21  41  16  16
332  32   6  35   2  47
333  46   7   4  39  15

[334 rows x 5 columns]

In [44]:
sortdf.head()

    0   1   2   3   4
0  26   8  46   7  42
1  23  25  12  32  16
2  19   7   2  21  40
3  46  35  31  19  18
4  39  42  29  34  49

In [47]:
sortdf.sort_index(axis=1,ascending=False) # To Column

      4   3   2   1   0
0    42   7  46   8  26
1    16  32  12  25  23
2    40  21   2   7  19
3    18  19  31  35  46
4    49  34  29  42  39
..   ..  ..  ..  ..  ..
329   1  45  19  48   3
330   3   1  19  10  24
331  16  16  41  21   8
332  47   2  35   6  32
333  15  39   4   7  46

[334 rows x 5 columns]

In [48]:
sortdf.sort_index(axis=0,ascending=False) # To Row

      0   1   2   3   4
333  46   7   4  39  15
332  32   6  35   2  47
331   8  21  41  16  16
330  24  10  19   1   3
329   3  48  19  45   1
..   ..  ..  ..  ..  ..
4    39  42  29  34  49
3    46  35  31  19  18
2    19   7   2  21  40
1    23  25  12  32  16
0    26   8  46   7  42

[334 rows x 5 columns]

In [50]:
type(sortdf)

pandas.core.frame.DataFrame

In [52]:
type(sortdf[0])

pandas.core.series.Series

### Update Value (loc)

In [66]:
sortdf.loc[0,0]=654

In [67]:
sortdf

       0   1   2   3   4
0    654   8  46   7  42
1     23  25  12  32  16
2     19   7   2  21  40
3     46  35  31  19  18
4     39  42  29  34  49
..   ...  ..  ..  ..  ..
329    3  48  19  45   1
330   24  10  19   1   3
331    8  21  41  16  16
332   32   6  35   2  47
333   46   7   4  39  15

[334 rows x 5 columns]

In [68]:
sortdf.columns=list("ABCDE")

In [69]:
sortdf

       A   B   C   D   E
0    654   8  46   7  42
1     23  25  12  32  16
2     19   7   2  21  40
3     46  35  31  19  18
4     39  42  29  34  49
..   ...  ..  ..  ..  ..
329    3  48  19  45   1
330   24  10  19   1   3
331    8  21  41  16  16
332   32   6  35   2  47
333   46   7   4  39  15

[334 rows x 5 columns]

In [71]:
sortdf.loc[0,'B']=774

In [72]:
sortdf

       A    B   C   D   E
0    654  774  46   7  42
1     23   25  12  32  16
2     19    7   2  21  40
3     46   35  31  19  18
4     39   42  29  34  49
..   ...  ...  ..  ..  ..
329    3   48  19  45   1
330   24   10  19   1   3
331    8   21  41  16  16
332   32    6  35   2  47
333   46    7   4  39  15

[334 rows x 5 columns]

In [78]:
sortdf.loc[:,:] # to see all the row and column values

       A    B   C   D   E
0    654  774  46   7  42
1     23   25  12  32  16
2     19    7   2  21  40
3     46   35  31  19  18
4     39   42  29  34  49
..   ...  ...  ..  ..  ..
329    3   48  19  45   1
330   24   10  19   1   3
331    8   21  41  16  16
332   32    6  35   2  47
333   46    7   4  39  15

[334 rows x 5 columns]

### Single Condition

In [92]:
sortdf.loc[(sortdf['A']>48)]

       A    B   C   D   E
0    654  774  46   7  42
11    49   19  11  11   6
34    49   22  13  13  34
137   49   41  44  48  28
159   49   23  33   6  12
299   49   10  32  11   0
302   49   47  20  30  47

### Multiple Condition

In [95]:
sortdf.loc[(sortdf['A']>48) & (sortdf['C']>40)]

       A    B   C   D   E
0    654  774  46   7  42
137   49   41  44  48  28

### iloc

In [107]:
sortdf.iloc[0,4]

np.int32(42)

In [108]:
newdf.iloc[[0,225],[0,2]]

            0         2
0    0.261221  0.293431
225  0.755377  0.466120

| Feature                | `.loc`                                                             | `.iloc`                                                                 |
| ---------------------- | ------------------------------------------------------------------ | ----------------------------------------------------------------------- |
| **Type of indexing**   | **Label-based** → You select rows/columns by their names (labels). | **Integer-based** → You select rows/columns by their integer positions. |
| **Inclusive behavior** | Both start and end labels are **inclusive** when slicing.          | The end index is **exclusive** when slicing (like Python list slicing). |
| **Accepts**            | Row/column labels, boolean arrays, slices with labels.             | Row/column integer positions, boolean arrays, slices with integers.     |
| **Errors**             | Throws `KeyError` if label is not found.                           | Throws `IndexError` if index is out of range.                           |

### drop

### row

In [109]:
sortdf.drop(2)

       A    B   C   D   E
0    654  774  46   7  42
1     23   25  12  32  16
3     46   35  31  19  18
4     39   42  29  34  49
5     12   24   7  14  22
..   ...  ...  ..  ..  ..
329    3   48  19  45   1
330   24   10  19   1   3
331    8   21  41  16  16
332   32    6  35   2  47
333   46    7   4  39  15

[333 rows x 5 columns]

### column

In [111]:
sortdf.drop(['E'],axis=1)

       A    B   C   D
0    654  774  46   7
1     23   25  12  32
2     19    7   2  21
3     46   35  31  19
4     39   42  29  34
..   ...  ...  ..  ..
329    3   48  19  45
330   24   10  19   1
331    8   21  41  16
332   32    6  35   2
333   46    7   4  39

[334 rows x 4 columns]

### Permanently Drop Column

In [115]:
sortdf.drop(['D'],axis=1,inplace=True)

In [116]:
sortdf

       A    B   C   E
0    654  774  46  42
1     23   25  12  16
2     19    7   2  40
3     46   35  31  18
4     39   42  29  49
..   ...  ...  ..  ..
329    3   48  19   1
330   24   10  19   3
331    8   21  41  16
332   32    6  35  47
333   46    7   4  15

[334 rows x 4 columns]

### Permanently Drop Row

In [118]:
sortdf.drop([2,3],axis=0,inplace=True)

In [119]:
sortdf

       A    B   C   E
0    654  774  46  42
1     23   25  12  16
4     39   42  29  49
5     12   24   7  22
6     42   49  31  36
..   ...  ...  ..  ..
329    3   48  19   1
330   24   10  19   3
331    8   21  41  16
332   32    6  35  47
333   46    7   4  15

[332 rows x 4 columns]

### Reset Rows

In [121]:
sortdf.reset_index() #adds an extra index

     index    A    B   C   E
0        0  654  774  46  42
1        1   23   25  12  16
2        4   39   42  29  49
3        5   12   24   7  22
4        6   42   49  31  36
..     ...  ...  ...  ..  ..
327    329    3   48  19   1
328    330   24   10  19   3
329    331    8   21  41  16
330    332   32    6  35  47
331    333   46    7   4  15

[332 rows x 5 columns]

In [123]:
sortdf.reset_index(drop=True)#drops the extra index

       A    B   C   E
0    654  774  46  42
1     23   25  12  16
2     39   42  29  49
3     12   24   7  22
4     42   49  31  36
..   ...  ...  ..  ..
327    3   48  19   1
328   24   10  19   3
329    8   21  41  16
330   32    6  35  47
331   46    7   4  15

[332 rows x 4 columns]

### Null

In [124]:
sortdf.loc[4]=None

In [125]:
sortdf

         A      B     C     E
0    654.0  774.0  46.0  42.0
1     23.0   25.0  12.0  16.0
4      NaN    NaN   NaN   NaN
5     12.0   24.0   7.0  22.0
6     42.0   49.0  31.0  36.0
..     ...    ...   ...   ...
329    3.0   48.0  19.0   1.0
330   24.0   10.0  19.0   3.0
331    8.0   21.0  41.0  16.0
332   32.0    6.0  35.0  47.0
333   46.0    7.0   4.0  15.0

[332 rows x 4 columns]

In [126]:
sortdf.loc[4].isnull() #check

A    True
B    True
C    True
E    True
Name: 4, dtype: bool